{
  "app": {
    "name": {
      "neutral": "PHONE TO",
      "accent": "COUNTRY"
    }
  },
  "language-select": {
    "locale": "Langue"
  },
  "nav": {
    "Home": { "nav-name": "Accueil", "label": "", "description": "" },
    "About": { "nav-name": "À propos", "label": "", "description": "" },
    "Select with input": {
      "nav-name": "Select code pays",
      "label": "Select pays + champ",
      "description": "Select pour le code pays + champ texte pour le reste du téléphone"
    },
    "Double input": {
      "nav-name": "Double champs",
      "label": "Double champ",
      "description": "Champ texte pour le code pays, champ texte pour le reste du numéro"
    },
    "Single input": {
      "nav-name": "Champ avec API",
      "label": "Champ simple avec API externe",
      "description": "Un seul champ texte pour code + téléphone"
    }
  },
  "home": {
    "title": "Page d'accueil",
    "description": "Application pour récupérer le pays d'un utilisateur à partir de son indice téléphonique.",
    "keywords": "localisation, input, téléphone, indice téléphonique, Vue 3, Vite"
  },
  "about": {
    "title": "À propos",
    "intro": "La consigne initiale était : Mettre en place un composant dynamique permettant d’entrer un numéro de téléphone et de reconnaître le pays de celui-ci automatiquement (indicatif du numéro → exemple : +33). J'ai choisi de présenter plusieurs solutions correspondant à cette consigne.",
    "select-section": {
      "heading": "Sélection d'un identifiant de pays + champ de texte",
      "text": "Il est virtuellement impossible sans base de données officielle de déduire le code du pays d'un numéro de téléphone, juste avec un algorithme. La solution la plus simple pour l'utilisateur, c'est donc de lui permettre de sélectionner son pays, puis de lui demander d'entre son numéro sans préfixe à côté. Les drapeaux et codes du select viennent d'un fichier json."
    },
    "double-input-section": {
      "heading": "Deux champs textes, un pour le code du pays, l'autre pour le numéro",
      "text": "La solution du select était aussi la plus simple pour moi : j'ai décidé de me compliquer la vie en laissant l'utilisateur entrer n'importe quoi comme code de pays et en traitant cette valeur. Elle est ensuite comparée avec les données du même fichier json que pour le select."
    },
    "single-input-section": {
      "heading": "Un seul champ texte, un appel API",
      "text": "La solution qui répond littéralement à la consigne, sans interprétation et sans vouloir améliorer l'UX, c'est de laisser l'utilisateur se débrouiller avec un seul champ, entrer son numéro AVEC préfixe, et le valider ou non en récupérant les données associées depuis une api. La seule api gratuite que j'ai trouvée qui n'implique pas de faire passer une clé privée dans du code client, c'est phone-number-api, mais elle devient payante lorsqu'on veut envoyer des requêtes ssl (https). Or, chrome déclenche une redirection interne de la requête de http vers https, en tout cas en local. Je n'ai pas le temps de trouver la solution à ce problème. Sur firefox, ça fonctionne chez moi."
    },
    "bonus": {
      "heading": "Bonus",
      "text": "Internationalisation (select pour changer de langage), style avec tailwindcss, modes sombres/clairs, github pour suivre l'avancement du projet. Vue router, navigation dynamique basée sur les routes déclarées dans le routeur."
    },
    "github-link": "Repo GitHub"
  },
  "fields": {
    "number-input": {
      "label": "Téléphone",
      "placeholder": "Ex : 675442334",
      "hint": "Votre numéro sans le code de votre pays",
      "error": "Veuillez entrer un numéro de téléphone valide."
    },
    "country-code-input": {
      "label": "Code de pays",
      "placeholder": "Ex : +33",
      "hint": "Doit commencer par un +.",
      "error": "Entrez un code de pays valide."
    },
    "country-code-select": {
      "label": "Pays",
      "placeholder": "Select a country",
      "hint": "Sera utilisé pour préfixer votre numéro.",
      "error": "Veuillez sélectionner un pays."
    },
    "prefixed-number-input": {
      "label": "Téléphone (avec préfixe)",
      "placeholder": "Ex : +33675442334",
      "hint": "Votre numéro avec le préfixe de votre pays.",
      "error": "Veuillez entrer un numéro de téléphone valide avec préfixe.",
      "api-error": "Essayez avec un autre navigateur. Celui-ci envoie probablement la requête en https, et l'api est payante pour les requêtes ssl... (cf. console)"
    }
  },
  "results": {
    "empty": "Pas encore de valeur",
    "country-name": "Votre pays",
    "country-id": "Identifiant du pays",
    "code": "Code du pays",
    "number": "Votre numéro"
  },
  "footer": {
    "text": "Adélie Castel - 15/12/22"
  }
}
